RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32F5xx_Firmware_Library/GD32F5xx_standard_peripheral/Include/gd32f5xx_sai.h
/* SAI interrupt enable or disable */
#define SAI_INT_OUERR                   SAI_INTEN_OUERRIE                           /*!< FIFO overrun or underrun interrupt enable */
#define SAI_INT_MTDET                   SAI_INTEN_MTDETIE                           /*!< mute detection interrupt enable */
#define SAI_INT_ERRCK                   SAI_INTEN_ERRCKIE                           /*!< error clock interrupt enable */
#define SAI_INT_FFREQ                   SAI_INTEN_FFREQIE                           /*!< FIFO request interrupt enable */
#define SAI_INT_ACNRDY                  SAI_INTEN_ACNRDYIE                          /*!< audio codec not ready interrupt enable */
#define SAI_INT_FSADET                  SAI_INTEN_FSADETIE                          /*!< frame synchronization advanced detection interrupt enable */
#define SAI_INT_FSPDET                  SAI_INTEN_FSPDETIE                          /*!< frame synchronization postpone detection interrupt enable */

/* SAI flags */
#define SAI_FLAG_OUERR                  SAI_STAT_OUERR                              /*!< FIFO overrun or underrun flag */
#define SAI_FLAG_MTDET                  SAI_STAT_MTDET                              /*!< mute detection flag */
#define SAI_FLAG_ERRCK                  SAI_STAT_ERRCK                              /*!< error clock flag */
#define SAI_FLAG_FFREQ                  SAI_STAT_FFREQ                              /*!< FIFO request flag */
#define SAI_FLAG_ACNRDY                 SAI_STAT_ACNRDY                             /*!< audio codec not ready flag */
#define SAI_FLAG_FSADET                 SAI_STAT_FSADET                             /*!< frame synchronization advanced detection flag */
#define SAI_FLAG_FSPDET                 SAI_STAT_FSPDET                             /*!< frame synchronization postpone detection flag */

/* SAI FIFO status */
#define STAT_FFSTAT(regval)             (BITS(16,18)&((uint32_t)(regval) << 16U))
#define SAI_FIFO_STAT_EMPTY              STAT_FFSTAT(0)                             /*!< FIFO status empty */
#define SAI_FIFO_STAT_QUARTER            STAT_FFSTAT(1)                             /*!< receiver: empty < FIFO <= 1/4,  transmitter: empty <  FIFO < 1/4 */
#define SAI_FIFO_STAT_HALF               STAT_FFSTAT(2)                             /*!< receiver: 1/4   < FIFO <= 1/2,  transmitter: 1/4   <= FIFO < 1/2 */
#define SAI_FIFO_STAT_THREE_QUARTER      STAT_FFSTAT(3)                             /*!< receiver: 1/2   < FIFO <= 3/4,  transmitter: 1/2   <= FIFO < 3/4 */
#define SAI_FIFO_STAT_NEARFULL           STAT_FFSTAT(4)                             /*!< receiver: 3/4   < FIFO <  full, transmitter: 3/4   <= FIFO < full */
#define SAI_FIFO_STAT_FULL               STAT_FFSTAT(5)                             /*!< FIFO status full */

#define SAI_BLOCK0                      ((uint32_t)0x00000000U)                     /*!< Block 0 */
#define SAI_BLOCK1                      ((uint32_t)0x00000001U)                     /*!< Block 1 */

/* function declarations */
/* SAI deinitialization and initialization functions */
/* reset SAI */
void sai_deinit(void);

/* initialize SAI parameter struct with the default values */
void sai_struct_para_init(sai_parameter_struct *sai_init_stuct);
/* initialize SAI frame parameter struct with the default values */
void sai_frame_struct_para_init(sai_frame_parameter_struct *sai_frame_init_struct);
/* initialize SAI slot parameter struct with the default values */
void sai_slot_struct_para_init(sai_slot_parameter_struct *sai_slot_init_struct);

/* initialize SAI */
void sai_init(uint32_t block, sai_parameter_struct *sai_struct);
/* initialize SAI frame */
void sai_frame_init(uint32_t block, sai_frame_parameter_struct *sai_frame_struct);
/* initialize SAI slot */
void sai_slot_init(uint32_t block, sai_slot_parameter_struct *sai_slot_struct);

/* sai enable*/
void sai_enable(uint32_t block);
/* sai disable*/
void sai_disable(uint32_t block);

/* SAI configuration functions */
/* SAI serial data near inactive slot output management */
void sai_sdoutput_config(uint32_t block, uint32_t sdout);
/* configure SAI mono mode */
void sai_monomode_config(uint32_t block, uint32_t mono);
/* configure SAI companding mode */
void sai_companding_config(uint32_t block, uint32_t compander, uint32_t complement);
/* enable SAI mute detected or mute send */
void sai_mute_enable(uint32_t block);
/* disable SAI mute detected or mute send */
void sai_mute_disable(uint32_t block);
/* configure SAI mute value */
void sai_mute_value_config(uint32_t block, uint32_t value);
/* configure SAI mute frame count */
void sai_mute_count_config(uint32_t block, uint32_t count);
/* SAI transmit data */
void sai_data_transmit(uint32_t block, uint32_t data);
/* SAI receive data */
uint32_t sai_data_receive(uint32_t block);
/* get SAI fifo status */
sai_fifo_state_enum sai_fifo_status_get(uint32_t block);
/* SAI fifo flush */
void sai_fifo_flush(uint32_t block);

/* SAI DMA functions */
/* enable SAI dma */
void sai_dma_enable(uint32_t block);
/* disable SAI dma */
void sai_dma_disable(uint32_t block);

/* flag and interrupt functions */
/* enable the SAI interrupt */
void sai_interrupt_enable(uint32_t block, uint32_t interrupt);
/* disable the SAI interrupt */
void sai_interrupt_disable(uint32_t block, uint32_t interrupt);
/* get SAI interrupt flag */
FlagStatus sai_interrupt_flag_get(uint32_t block, uint32_t interrupt);
/* clear SAI interrupt flag */
void sai_interrupt_flag_clear(uint32_t block, uint32_t interrupt);
/* get SAI flag */
FlagStatus sai_flag_get(uint32_t block, uint32_t flag);
/* clear SAI flag */
void sai_flag_clear(uint32_t block, uint32_t flag);

#endif /* GD32F5XX_SAI_H */
